Revit 2027 API
MEPAnalyticalSegment.DemandFlow Property
 The designed flow value, in ft^3/s.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double DemandFlow { get; }
Public ReadOnly Property DemandFlow As Double
	Get
public:
property double DemandFlow {
	double get ();
}
member DemandFlow : float with get
Property Value
Double
See Also
Reference
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace